## Plan Result (annotations-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/178742)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod:759" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                        # (5 unchanged elements hidden)
                        {
                            name      = "DATABASE_WRITE_USER"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AnnotationsAPI/Prod/READITLA_DB:write_username::"
                        },
                      + {
                          + name      = "PARSER_BASE_ENDPOINT"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AnnotationsAPI/Prod/PARSER_ENDPOINT"
                        },
                      + {
                          + name      = "PARSER_DATA_PATH"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AnnotationsAPI/Prod/PARSER_CONFIG"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AnnotationsAPI/Prod/SENTRY_DSN"
                        },
                    ]
                    # (11 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-otel-collector"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/AnnotationsAPI-Prod/ecs/aws-otel-collector"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "aws-otel-collector"
                    portMappings           = [
                        {
                            containerPort = 4138
                            hostPort      = 4138
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                    systemControls         = []
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "AnnotationsAPI-Prod" -> (known after apply)
      ~ revision                 = 759 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "AnnotationsAPI"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn                                                           = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod:759" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"4b4f99a6-4464-40cd-b44d-28d3c0018e19","JobName":"annotations-api_infrastructure_plan_prod","PRNumber":536,"Program":"tfcmt","SHA1":"679242c39c277d3c083cf087b423240ffa4e5580","Target":"annotations-api-cdk","Vars":{}} -->